docs/API ISEE/Specifiche Servizio ConsultazioneISEE/ConsultazioneIndicatore__REQ_01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://inps.it/ConsultazioneISEE">
<soapenv:Header>
	<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">7e6416bf-f86b-495b-8f89-2d8e208aaf4c</wsa:MessageID>
	<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://msws2.svil.inps:80/WSServiziISEE/SvcConsultazione.svc</wsa:To>
	<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://inps.it/ConsultazioneISEE/ISvcConsultazione/ConsultazioneAttestazione</wsa:Action>
	<inps:Identity xmlns:inps="http://inps.it/">
		<UserId>Prova</UserId>
		<CodiceUfficio>1234</CodiceUfficio>
	</inps:Identity>
</soapenv:Header>
   <soapenv:Body>
		<con:ConsultazioneIndicatore>
			<con:request>
				<con:CodiceFiscale>RSSMRA70A01H501S</con:CodiceFiscale>
				<con:TipoIndicatore>Ordinario</con:TipoIndicatore>
				<con:DataValidita>2020-12-31</con:DataValidita>
				<con:PrestazioneDaErogare>A1.01</con:PrestazioneDaErogare>
				<con:ProtocolloDomandaEnteErogatore>Proto</con:ProtocolloDomandaEnteErogatore>
				<con:StatodomandaPrestazione>Da Erogare</con:StatodomandaPrestazione>
			</con:request>
		</con:ConsultazioneIndicatore>
   </soapenv:Body>
</soapenv:Envelope>